{
   "Mercury":{
      "info":"\n    Mercury is the smallest planet in our solar system. It’s just a little bigger than Earth’s moon.\n    It is the closest planet to the sun, but it’s actually not the hottest. Venus is hotter.\n    Along with Venus, Earth, and Mars, Mercury is one of the rocky planets.\n    It has a solid surface that is covered with craters. It has a thin atmosphere, and it doesn’t have any moons.\n    Mercury likes to keep things simple. This small planet spins around slowly compared to Earth, so one day lasts a long time.\n    Mercury takes 59 Earth days to make one full rotation. A year on Mercury goes by fast.\n    Because it’s the closest planet to the sun, it doesn’t take very long to go all the way around.\n    It completes one revolution around the sun in just 88 Earth days. If you lived on Mercury, you’d have a birthday every three months!\n    A day on Mercury is not like a day here on Earth. For us, the sun rises and sets each and every day.\n    Because Mercury has a slow spin and short year, it takes a long time for the sun to rise and set there.\n    Mercury only has one sunrise every 180 Earth days! Isn't that weird?",
      "source": ["NASA - https://spaceplace.nasa.gov/all-about-mercury/en/", "https://space-facts.com/mercury/"],
      "Planet Type": "Rocky Planet",
      "Diameter":   4879,
      "Mass": "3.30 x 10^23 kg (5.5% Earth)",
      "Number of Moons":   0,
      "Orbit Distance": 57909227,
      "AU": 0.39,
      "Orbit Period":  88,
      "Min Recorded Surface Temperature (°C)": -173,
      "Max Recorded Surface Temperature (°C)": 427,
      "First Record":  "14th century BC",
      "Recorded By":  " Assyrian astronomers"
   },
   "Venus":{
      "info":"Even though Venus isn't the closest planet to the sun, it is still the hottest.\nIt has a thick atmosphere full of the greenhouse gas carbon dioxide and clouds made of sulfuric acid.\nThe gas traps heat and keeps Venus toasty warm.\nIn fact, it's so hot on Venus, metals like lead would be puddles of melted liquid.\nVenus looks like a very active planet.\nIt has mountains and volcanoes.\nVenus is similar in size to Earth.\nEarth is just a little bit bigger.\nVenus is unusual because it spins the opposite direction of Earth and most other planets.\nAnd its rotation is very slow.\nIt takes about 243 Earth days to spin around just once.\nBecause it's so close to the sun, a year goes by fast.\nIt takes 225 Earth days for Venus to go all the way around the sun. \nThat means that a day on Venus is a little longer than a year on Venus.\nSince the day and year lengths are similar, one day on Venus is not like a day on Earth. \nHere, the sun rises and sets once each day. \nBut on Venus, the sun rises every 117 Earth days. \nThat means the sun rises two times during each year on Venus,\neven though it is still the same day on Venus! \nAnd because Venus rotates backwards, the sun rises in the west and sets in the east.\nJust like Mercury, Venus doesn’t have any moons.",
      "source":["NASA - https://spaceplace.nasa.gov/all-about-venus/en/","https://space-facts.com/venus/"],
      "Planet Type": "Rocky Planet",
      "Diameter":   12104,
      "Mass": "4.87 x 10^24 kg (81.5% Earth)",
      "Numnber of Moons":   0,
      "Orbit Distance": 108209475,
      "AU": 0.73,
      "Orbit Period (Days)":  225,
      "Min Recorded Surface Temperature (°C)": 462,
      "Max Recorded Surface Temperature (°C)": 462,
      "First Record":  "17th century BC",
      "Recorded By":  "Babylonian astronomers"
   },
   "Earth":{
      "info":"Our home planet Earth is a rocky, terrestrial planet.\nIt has a solid and active surface with mountains, valleys, canyons, plains and so much more.\nEarth is special because it is an ocean planet. Water covers 70% of Earth's surface.\n\nOur atmosphere is made mostly of nitrogen and has plenty of oxygen for us to breathe.\nThe atmosphere also protects us from incoming meteoroids,\nmost of which break up in our atmosphere before they can strike the surface as meteorites.\n\nSince we live here, you might think we know all there is to know about Earth.\nNot at all, actually! We have a lot we can learn about our home planet.\nRight now, there are many satellites orbiting Earth taking pictures and measurements.\nThis is how we can learn more about weather, oceans, soil, climate change, and many other important topics.",
      "source":["NASA - https://spaceplace.nasa.gov/all-about-earth/en/", "https://space-facts.com/earth/"],
      "Planet Type": "Rocky Planet",
      "Equatorial Diameter": 12756,
      "Polar Diameter": 12714,
      "Mass": "5.97 x 10^24 kg",
      "Moons":   "1 (The Moon)",
      "Orbit Distance":   "149,598,262 km (1 AU)",
      "Orbit Period (Days)":  365.24,
      "Min Recorded Surface Temperature (°C)": -88,
      "Max Recorded Surface Temperature (°C)": 58
   },
   "Mars":{
      "info":"Mars is a cold desert world.\nIt is half the size of Earth. Mars is sometimes called the Red Planet.\nIt's red because of rusty iron in the ground.\nLike Earth, Mars has seasons, polar ice caps, volcanoes, canyons, and weather.\nIt has a very thin atmosphere made of carbon dioxide, nitrogen, and argon.\nThere are signs of ancient floods on Mars, but now water mostly exists in icy dirt and thin clouds.\nOn some Martian hillsides, there is evidence of liquid salty water in the ground.\nScientists want to know if Mars may have had living things in the past.\nThey also want to know if Mars could support life now or in the future. ",
      "source":["NASA - https://spaceplace.nasa.gov/all-about-mars/en/", "https://space-facts.com/mars/"],
      "Planet Type": "Rocky Planet",
      "Equatorial Diameter (km)": 6792,
      "Polar Diameter (km)":   6752,
      "Mass": "6.42 x 10^23 kg (10.7% Earth)",
      "Moons":   "2 (Phobos & Deimos)",
      "Orbit Distance": "227,943,824 km (1.52 AU)",
      "Orbit Period (Days)":  687,
      "Surface Temperature": "-153 to 20 °C",
      "Min Recorded Surface Temperature (°C)": -153,
      "Max Recorded Surface Temperature (°C)": 20,
      "First Record":  "2nd millennium BC",
      "Recorded By":  "Egyptian astronomers"
   },
   "Jupiter":{
      "info":"Jupiter is the biggest planet in our solar system.\nIt's similar to a star, but it never got big enough to start burning.\nIt is covered in swirling cloud stripes.\nIt has big storms like the Great Red Spot, which has been going for hundreds of years.\nJupiter is a gas giant and doesn't have a solid surface, but it may have a solid inner core about the size of Earth.\nJupiter also has rings, but they're too faint to see very well.",
      "source": ["NASA - https://spaceplace.nasa.gov/all-about-jupiter/en/", "https://space-facts.com/jupiter/"],
      "Planet Type": "Gas Giant",
      "Equatorial Diameter (km)": 142984,
      "Polar Diameter (km)":   133709,
      "Mass": "1.90 × 10^27 kg (318 Earths)",
      "Moons":   "67 (Io, Europa, Ganymede & Callisto)",
      "Rings":   4,
      "Orbit Distance":   "778,340,821 km (5.20 AU)",
      "Orbit Period (Days)":  4333,
      "Effective Temperature":  -178,
      "First Record":  "7th or 8th century BC",
      "Recorded By":   "Babylonian astronomers"
   },
   "Saturn":{
      "info":"Saturn isn’t the only planet to have rings, but it definitely has the most beautiful ones.\nThe rings we see are made of groups of tiny ringlets that surround Saturn.\nThey’re made of chunks of ice and rock.\nLike Jupiter, Saturn is mostly a ball of hydrogen and helium.\nWhen Galileo Galilei saw Saturn through a telescope in the 1600s, he wasn't sure what he was seeing.\nAt first he thought he was looking at three planets, or a planet with handles.\nNow we know those \"handles\" turned out to be the rings of Saturn.",
      "source":["NASA - https://spaceplace.nasa.gov/all-about-saturn/en/", "https://space-facts.com/saturn/"],
      "Planet Type": "Gas Giant",
      "Equatorial Diameter (km)": 120536,
      "Polar Diameter (km)":   108728,
      "Mass": "5.68 × 10^26 kg (95 Earths)",
      "Moons":   "62 (Titan, Enceladus, Iapetus & Rhea)",
      "Rings":   "30+ (7 Groups)",
      "Orbit Distance":   "1,426,666,422 km (9.54 AU)",
      "Orbit Period (Days)":  10756,
      "Effective Temperature (°C)":  -178,
      "First Record":  "8th century BC",
      "Recorded By":   "Assyrians"
   },
   "Uranus":{
      "info":"Uranus is made of water, methane, and ammonia fluids above a small rocky center.\nIts atmosphere is made of hydrogen and helium like Jupiter and Saturn, but it also has methane.\nThe methane makes Uranus blue.\nUranus also has faint rings.\nThe inner rings are narrow and dark.\nThe outer rings are brightly colored and easier to see.\nLike Venus, Uranus rotates in the opposite direction as most other planets.\nAnd unlike any other planet, Uranus rotates on its side.",
      "source":["NASA - https://spaceplace.nasa.gov/all-about-uranus/en/", "https://space-facts.com/uranus/"],
      "Planet Type": "Ice Giant",
      "Equatorial Diameter (km)": 51118,
      "Polar Diameter (km)":   49946,
      "Mass": "8.68 × 10^25 kg (15 Earths)",
      "Moons":   "27 (Miranda, Titania, Ariel, Umbriel & Oberon)",
      "Rings":   13,
      "Orbit Distance":   "2,870,658,186 km (19.19 AU)",
      "Orbit Period (Days)":  30687,
      "Effective Temperature (°C)":  -216,
      "Discovery Date":   "March 13th 1781",
      "Discovered By": "William Herschel"
   },
   "Neptune":{
      "info":"Neptune is dark, cold, and very windy.\nIt's the last of the planets in our solar system.\nIt's more than 30 times as far from the sun as Earth is.\nNeptune is very similar to Uranus. It's made of a thick soup of water, ammonia, and methane over an Earth-sized solid center.\nIts atmosphere is made of hydrogen, helium, and methane.\nThe methane gives Neptune the same blue color as Uranus.\nNeptune has six rings, but they're very hard to see.",
      "source":["NASA - https://spaceplace.nasa.gov/all-about-neptune/en/","https://space-facts.com/neptune/"],
      "Planet Type": "Ice Giant",
      "Equatorial Diameter (km)": 49528,
      "Polar Diameter (km)":   48682,
      "Mass": "1.02 × 10^26 kg (17 Earths)",
      "Moons":  "14 (Triton)",
      "Rings":   5,
      "Orbit Distance":   "4,498,396,441 km (30.10 AU)",
      "Orbit Period (Days)":  60190,
      "Effective Temperature (°C)":  -214,
      "Discovery Date":   "September 23rd 1846",
      "Discovered By": "Urbain Le Verrier & Johann Galle"

   }
}